// Огнен Николовски ИНКИ997 - Објаснување за програма за фреквенција на прости броеви под 100,000
/*
 програма на C за пресметување на фреквенцијата на прости броеви помали од 100,000, 
 со користење на функцијата clock() за измерување на времето потребно за извршување на програмата.
*/

/* clock example: frequency of primes */
#include <stdio.h>      /* printf */
#include <time.h>       /* clock_t, clock, CLOCKS_PER_SEC */
#include <math.h>       /* sqrt */
/* 

Прво се вклучуваат три библиотеки: stdio.h, time.h и math.h, 
кои ги овозможуваат операциите за печатење на излез на екран, 
работа со времето и математички операции, соодветно.

*/
int frequency_of_primes (int n) {
  int i,j;
  int freq=n-1;
  for (i=2; i<=n; ++i) for (j=sqrt(i);j>1;--j) if (i%j==0) {--freq; break;}
  return freq;
}
/* 

Потоа се дефинира функција frequency_of_primes која прима еден аргумент n, а ја пресметува фреквенцијата на простите броеви помали од n.
Иницијализираме ги променливите i, j и freq. Променливата freq ја иницијализираме со вредноста n-1, 
бидејќи сите броеви помали од n се сметаат за прости се додека не се докаже спротивното. Преку две вметнати for лупи, 
го проверуваме секој број помеѓу 2 и n дали е прост. 

За секој број го испитуваме дали е делив со броеви помали од неговата квадратна коренка.
Ако е делен со било кој број помеѓу 2 и квадратната коренка, бројот не е прост и го намалуваме бројот на прости во freq за 1. 
Функцијата ја враќа вредноста на freq.

*/

int main ()
{
  clock_t t; /* Декларирајте ја променливата за чување на времето на часовникот */
  int f;     /* Декларирајте ја променливата за чување на бројот на прости броеви */
  t = clock(); /* Запишете го моменталното време на часовникот */
  printf ("Calculating...\n"); 
  f = frequency_of_primes (99999); /* Пресметајте го бројот на прости броеви помали од 100,000 */
  printf ("The number of primes lower than 100,000 is: %d\n",f);
  t = clock() - t; /* Пресметајте го времето поминато од последното повикување на clock() */
  printf ("It took me %d clicks (%f seconds).\n",t,((float)t)/CLOCKS_PER_SEC);
  return 0;
} 


/* 
Главната функција main() во оваа програма е водечка точка и ја содржи извршната логика на програмата. 
Оваа функција започнува со декларација на променливите t и f, соодветно clock_t и int.

Променливата t ја користиме за мерење на времето на извршувањето на програмата и ја поставуваме на почетокот со функцијата clock() 
која ја повикуваме без аргументи и го запишува во t.

Откако ќе ја дефинираме t, ќе се испечати пораката "Calculating..." со функцијата printf().

Потоа ќе се повика функцијата frequency_of_primes() и ќе се предаде аргумент 99999. Резултатот од оваа функција ќе се зачува во f.

Откако ќе се пресмета бројот на прости броеви помали од 100,000, функцијата clock() ќе се повика повторно и ќе се одземе од вредноста на t.
Резултатот од оваа операција ќе биде времето во единици на мерка на процесорот.

Со користење на printf(), на крајот ќе се испечати колку време е потребно за извршување на програмата.


*/